/******************************************************************************

                              Online C++ Compiler.
               Code, Compile, Run and Debug C++ program online.
Write your code in this editor and press "Run" button to compile and execute it.

*******************************************************************************/

#include <iostream>

using namespace std;

int main()
{
    int day;
    cin >> day; 
    
    switch (day) {
        case 1:
        cout << "Monday";
        //break;
        case 2:
        cout << "Tuesday";
        //break;
        case 3:
        cout << "Wednesday";
        //break;
        case 4:
        cout << "Thursday";
        //break;
        case 5:
        cout << "Friday";
        //break;
        case 6:
        cout << "Saturday";
        //break;
        case 7:
        cout << "Sunday";
        //break;
        default:
        cout << "Invalid day!";
    } 

/////////////////////////////////////////////////////////////////////////////////////////////////////////////

    for(int i = 0; i <= 5; i++) {
        cout << i;
        break; //прекъсва се цикъла при първата итерация
    }


/////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Потребителят въвежда числа, докато не се въведе 0

    int num;
    
    while (true) {
        cin >> num;
        
        if(num == 0)
        {
            break;
        }
    }
   
////////////////////////////////////////////////////////////////////////////////////////////////////////////

//Да се въведат цели
//положителни числа
//и да се намери
//сумата им.
//Въвеждането да
//спре при срещане
//на 0 или на
//отрицателно число
//и то да не участва в
//изчислението на
//сумата).

    int sum = 0, number;
    while (true) { // безкраен цикъл
        cin >> number;
        if (number <= 0)
            break;
        sum = sum + number;
    }
    
////////////////////////////////////////////////////////////////////////////////////////////////////////////

    cout << "Познай от 3 пъти колко имам по информатика: ";
    for (int i = 0; i < 3; i++) {
        int grade;
        cin >> grade;
        if (grade == 6) {
            cout << "Точно така, позна!" << endl;
            break;
        }
    cout << "Не позна :(" << endl;
    }
 
 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////   
    //Задачи(какво ще изведе следният код)
    
    for(int i = 5; i <= 0; i--) {
        cout << i;
        if(i == 3) {
            break;
        }
    }
    
    for (int i = 5; i >= 0; i--) {
        cout << i;
        if (i == 3) {
            break;
        }
    }
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    int num = 0;
    while(true)
    {
        if(num % 10 == 5)
        {
            break;
        }
        num++;
        cout << num;
    }
////////////////////////////////////////////////////////////////////////////////////////////////////////////
  
}
